app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `category_id`, `user_id`) VALUES ('Novo article', 'Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste Teste ', '2023-12-15 12:14:22.158770', '2023-12-15 12:14:22.158770', 5, 1)

  def update
    if @article.update(article_params)
---
UPDATE `articles` SET `articles`.`updated_at` = '2023-12-14 14:46:54.577878', `articles`.`category_id` = 6 WHERE `articles`.`id` = 9

  def destroy
    @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 8

  def set_article
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 13 LIMIT 1