app/controllers/articles_controller.rb

SELECT COUNT(*) AS `count_all`, CAST(DATE_FORMAT(CONVERT_TZ(`articles`.`created_at`, '+00:00', 'Etc/UTC'), '%Y-%m-01') AS DATE) AS `cast_date_format_convert_tz_articles_created_at_00_00_etc_utc_y_m_01_as_date` FROM `articles` WHERE (`articles`.`created_at` IS NOT NULL) GROUP BY CAST(DATE_FORMAT(CONVERT_TZ(`articles`.`created_at`, '+00:00', 'Etc/UTC'), '%Y-%m-01') AS DATE)
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`name` ASC
SELECT `articles`.* FROM `articles` ORDER BY `articles`.`created_at` DESC LIMIT 3
SELECT `articles`.* FROM `articles` WHERE `articles`.`created_at` BETWEEN '2023-11-01' AND '2023-11-30' ORDER BY `articles`.`created_at` DESC LIMIT 3
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (14, 13, 5)
SELECT `articles`.* FROM `articles` WHERE (id NOT IN(12,11)) AND `articles`.`category_id` = 5 ORDER BY `articles`.`created_at` DESC LIMIT 2 OFFSET 0
---
  def index
    @archives = Article.group_by_month(:created_at, format: '%B %Y', locale: :en).count

    category = @categories.find {|c| c.name == params[:category]} if params[:category].present?
    month_year = @archives.find {|m| m[0] == params[:month_year]}&.first if params[:month_year].present?

    @highlights = Article.includes(:category, :user)
                          .filter_by_category(category)
                          .filter_by_archive(month_year)
                          .desc_order
                          .first(3)


    highlight_ids = @highlights.pluck(:id).join(',')

    @articles = Article.includes(:category, :user)
                        .without_highlights(highlight_ids)
                        .filter_by_category(category)
                        .filter_by_archive(month_year)
                        .desc_order
                        .page(current_page)

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 94 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @article = Article.includes(comments: :user).find(params[:id])

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `category_id`, `user_id`) VALUES ('24324234', '234234324324324324', '2024-01-16 13:09:35.427919', '2024-01-16 13:09:35.427919', 6, 1)
---
  def create
    @article = current_user.articles.new(article_params)

    if @article.save

UPDATE `articles` SET `articles`.`body` = 'post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto post com muito texto ', `articles`.`updated_at` = '2023-12-07 13:25:22.583659' WHERE `articles`.`id` = 3
---
  def update
    if @article.update(article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 141
---
  def destroy
    @article.destroy

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 131 LIMIT 1
---
  def set_article
    @article = Article.find(params[:id])