app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    authorize @category

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Nova teste', '2023-12-20 12:22:17.898008', '2023-12-20 12:22:17.898008')

  def update

    authorize @category

    respond_to do |format|
      if @category.update(category_params)
---
UPDATE `categories` SET `categories`.`name` = 'Nova categ', `categories`.`updated_at` = '2023-12-20 12:22:26.679596' WHERE `categories`.`id` = 5

  def destroy
    if @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 7