app/controllers/comments_controller.rb

	def create
		@article.comments.create(comment_params.to_h.merge!({user_id: current_user.id}))
---
INSERT INTO `comments` (`body`, `article_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Primeiro comentário', 94, 1, '2024-01-03 12:59:09.395317', '2024-01-03 12:59:09.395317')

	def destroy
		comment = @article.comments.find(params[:id])
		authorize comment

		comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 94 AND `comments`.`id` = 7 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 7

	def set_article
		@article = Article.find(params[:article_id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 94 LIMIT 1